# St7SetVertexHeatSource1

Assigns a heat source to the specified vertex.

long St7SetVertexHeatSource1(long uID, long VertexNum, long CaseNum,

double* Doubles)

Input Parameters

uID

Strand7 model file ID.

VertexNum

Vertex number.

CaseNum

Load case number.

Doubles[0]

Heat source.